In [1]:
import numpy as np
import pandas as pd
from statsmodels.tsa.ar_model import AutoReg
import datetime as dt
from matplotlib import pyplot as plt

In [2]:
train = pd.read_csv("train.csv")
train.head(100)

               datetime   total
0   01.01.2005 00:00:00       ?
1   01.01.2005 01:00:00  154140
2   01.01.2005 02:00:00  157818
3   01.01.2005 03:00:00  149311
4   01.01.2005 04:00:00  138282
..                  ...     ...
95  04.01.2005 23:00:00  208885
96  05.01.2005 00:00:00  181284
97  05.01.2005 01:00:00  146594
98  05.01.2005 02:00:00  129392
99  05.01.2005 03:00:00  118012

[100 rows x 2 columns]

In [3]:
time_format = "%d.%m.%Y %H:%M:%S"
train["datetime"] = [dt.datetime.strptime(s, time_format) for s in train["datetime"]]

In [4]:
median_total = np.median(train["total"][train["total"] != "?"].astype(np.int64))

In [5]:
train["total"].replace("?", median_total, inplace=True)
train

                 datetime     total
0     2005-01-01 00:00:00  195441.5
1     2005-01-01 01:00:00    154140
2     2005-01-01 02:00:00    157818
3     2005-01-01 03:00:00    149311
4     2005-01-01 04:00:00    138282
...                   ...       ...
35059 2008-12-31 19:00:00    249376
35060 2008-12-31 20:00:00    246511
35061 2008-12-31 21:00:00    226469
35062 2008-12-31 22:00:00    199907
35063 2008-12-31 23:00:00    151086

[35064 rows x 2 columns]

In [5]:
series = train.total.values

In [6]:
ar = AutoReg(series, lags=168).fit()

In [7]:
answer = ar.predict(start=35064, end=35064+4344-1, dynamic=False)

In [8]:
with open("answer.txt", "w") as f:
    for v in answer:
        f.write(str(v))
        f.write('\n')